#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repository_from_template["repo1"].github_branch.template_files[0] will be created
  + resource "github_branch" "template_files" {
      + branch        = "template_files"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "testing-template-repository-jkshdbjk"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_from_template["repo1"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "testing-template-repository-jkshdbjk"
    }

  # module.repository_from_template["repo1"].github_branch_protection_v3.main[0] will be created
  + resource "github_branch_protection_v3" "main" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "testing-template-repository-jkshdbjk"
      + require_conversation_resolution = true
      + require_signed_commits          = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_teams                 = [
              + "@flufi-io/devops-engineers",
            ]
          + dismissal_users                 = [
              + "pipo-flufi",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "terratest",
            ]
          + strict   = true
        }

      + restrictions {
          + teams = [
              + "@flufi-io/devops-engineers",
            ]
          + users = [
              + "pipo-flufi",
            ]
        }
    }

  # module.repository_from_template["repo1"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "testing template repository"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "testing-template-repository-jkshdbjk"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".config/.terraform-docs.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            formatter: markdown table
            
            version: ""
            
            header-from: main.tf
            footer-from: ""
            
            recursive:
              enabled: false
              path: modules
            
            sections:
              show:
                - header
                - inputs
                - providers
                - modules
                - outputs
            
            #content: ""
            content: |-
              # Examples
              ```hcl
              {{ include "examples/complete/README.md" }}
              ```
              {{ .Header }}
              {{ .Providers }}
              {{ .Inputs }}
              {{ .Outputs }}
              ## Resources
              {{ range .Module.Resources }}
              - {{ .GetMode }}.{{ .Spec }} ({{ .Position.Filename }}#{{ .Position.Line }})
              {{- end }}
            
            output:
              file: README.md
              mode: inject
              template: |-
                <!-- BEGIN_TF_DOCS -->
                {{ .Content }}
                <!-- END_TF_DOCS -->
            
            
            sort:
              enabled: true
              by: name
            
            settings:
              anchor: true
              color: true
              default: true
              description: false
              escape: true
              hide-empty: true
              html: true
              indent: 2
              lockfile: true
              read-comments: true
              required: true
              sensitive: true
              type: true
        EOT
      + file                = ".config/.terraform-docs.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".env.example"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            TFE_TOKEN=
            OAUTH_TOKEN_ID=
        EOT
      + file                = ".env.example"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @devops-engineers
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/workflows/infracost.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # The GitHub Actions docs (https://docs.github.com/en/actions/reference/workflow-syntax-for-github-actions#on)
            # describe other options for 'on', 'pull_request' is a good default.
            name: infracost
            on: [ pull_request ]
            
            permissions:
              id-token: write
              contents: read
              pull-requests: write
            
            env:
              TFE_TOKEN: ${{ secrets.TFE_TOKEN_SANDBOX }}
            
            jobs:
              infracost:
                runs-on: ubuntu-latest # The following are JavaScript actions (not Docker)
                env:
                  working-directory: main/examples/complete/ # Update this!
                name: Run Infracost
                steps:
                  - name: configure aws credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: ${{ secrets.OIDC_ROLE }}
                      aws-region: ${{ secrets.AWS_REGION }}
            
                  - name: checkout
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.event.pull_request.head.ref }}
                      path: main
            
                  # Typically the Infracost actions will be used in conjunction with
                  # https://github.com/hashicorp/setup-terraform. Subsequent steps
                  # can run Terraform commands as they would in the shell.
                  - name: Install terraform
                    uses: hashicorp/setup-terraform@v2
                    with:
                      terraform_version: 1.2.0
                      terraform_wrapper: false # This is recommended so the `terraform show` command outputs valid JSON
            
                  # IMPORTANT: add any required steps here to setup cloud credentials so Terraform can run
            
                  - name: Terraform init
                    run: terraform init
                    working-directory: ${{ env.working-directory }}
            
                  - name: Terraform plan
                    run: terraform plan  -out tfplan.binary
                    working-directory: ${{ env.working-directory }}
            
                  - name: Terraform show
                    run: terraform show  -json tfplan.binary > plan.json
                    working-directory: ${{ env.working-directory }}
            
                  # Install the Infracost CLI, see https://github.com/infracost/actions/tree/master/setup
                  # for other inputs such as version, and pricing-api-endpoint (for self-hosted users).
                  - name: Setup Infracost
                    uses: infracost/actions/setup@v1
                    with:
                      api-key: ${{ secrets.INFRACOST_API_KEY }}
            
                  # Generate Infracost JSON output, the following docs might be useful:
                  # Multi-project/workspaces: https://www.infracost.io/docs/features/config_file
                  # Combine Infracost JSON files: https://www.infracost.io/docs/features/cli_commands/#combined-output-formats
                  - name: Generate Infracost JSON
                    run: infracost breakdown --path plan.json --format json --out-file /tmp/infracost.json
                    working-directory: ${{ env.working-directory }}
                    # Env vars can be set using the usual GitHub Actions syntax
                    # See the list of supported Infracost env vars here: https://www.infracost.io/docs/integrations/environment_variables/
                    # env:
                    #   MY_ENV: ${{ secrets.MY_ENV }}
            
                  # See https://www.infracost.io/docs/features/cli_commands/#comment-on-pull-requests for other options.
                  - name: Post Infracost comment
                    run: |
                      # Posts a comment to the PR using the 'update' behavior.
                      # This creates a single comment and updates it. The "quietest" option.
                      # The other valid behaviors are:
                      #   delete-and-new - Delete previous comments and create a new one.
                      #   hide-and-new - Minimize previous comments and create a new one.
                      #   new - Create a new cost estimate comment on every push.
                      infracost comment github --path /tmp/infracost.json \
                                               --repo $GITHUB_REPOSITORY \
                                               --github-token ${{github.token}} \
                                               --pull-request ${{github.event.pull_request.number}} \
                                               --behavior update
        EOT
      + file                = ".github/workflows/infracost.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/workflows/terraform.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: terraform validate
            on:
              - pull_request
            permissions:
              id-token: write
              contents: read
              pull-requests: write
            env:
              TFE_TOKEN: ${{ secrets.TFE_TOKEN_SANDBOX }}
            jobs:
              terraform-validate:
                runs-on: ubuntu-latest
                defaults:
                  run:
                    working-directory: main/examples/complete/
            
                steps:
                  - name: configure aws credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: ${{ secrets.OIDC_ROLE }}
                      aws-region: ${{ secrets.AWS_REGION }}
            
                  - name: checkout
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.event.pull_request.head.ref }}
                      path: main
                  - uses: hashicorp/setup-terraform@v2
                    with:
                      terraform_version: 1.2.0
            
                  - name: Terraform fmt
                    id: fmt
                    run: terraform fmt -check
            
                  - name: Terraform Init
                    id: init
                    run: terraform init
            
                  - name: Terraform Validate
                    id: validate
                    run: terraform validate -no-color
                    working-directory: main/examples/complete/
            
                  - name: Terraform Plan
                    id: plan
                    run: terraform plan   -no-color
                    working-directory: main/examples/complete/
                    continue-on-error: true
            
                  - uses: actions/github-script@v6
                    if: github.event_name == 'pull_request'
                    env:
                      PLAN: "terraform\n${{ steps.plan.outputs.stdout }}"
                    with:
                      github-token: ${{ secrets.GITHUB_TOKEN }}
                      script: |
                        // 1. Retrieve existing bot comments for the PR
                        const { data: comments } = await github.rest.issues.listComments({
                          owner: context.repo.owner,
                          repo: context.repo.repo,
                          issue_number: context.issue.number,
                        })
                        const botComment = comments.find(comment => {
                          return comment.user.type === 'Bot' && comment.body.includes('Terraform Format and Style')
                        })
            
                        // 2. Prepare format of the comment
                        const output = `#### Terraform Format and Style 🖌\`${{ steps.fmt.outcome }}\`
                        #### Terraform Initialization ⚙️\`${{ steps.init.outcome }}\`
                        #### Terraform Validation 🤖\`${{ steps.validate.outcome }}\`
                        <details><summary>Validation Output</summary>
            
                        \`\`\`\n
                        ${{ steps.validate.outputs.stdout }}
                        \`\`\`
            
                        </details>
            
                        #### Terraform Plan 📖\`${{ steps.plan.outcome }}\`
            
                        <details><summary>Show Plan</summary>
            
                        \`\`\`\n
                        ${process.env.PLAN}
                        \`\`\`
            
                        </details>
            
                        *Pusher: @${{ github.actor }}, Action: \`${{ github.event_name }}\`, Working Directory: \`${{ env.tf_actions_working_dir }}\`, Workflow: \`${{ github.workflow }}\`*`;
            
                        // 3. If we have a comment, update it, otherwise create a new one
                        if (botComment) {
                          github.rest.issues.updateComment({
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            comment_id: botComment.id,
                            body: output
                          })
                        } else {
                          github.rest.issues.createComment({
                            issue_number: context.issue.number,
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            body: output
                          })
                        }
        EOT
      + file                = ".github/workflows/terraform.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/workflows/terrascan.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: terrascan
            on: [ push ]
            
            jobs:
              terrascan:
                runs-on: ubuntu-latest
                name: terrascan-action
                steps:
                  - name: Checkout repository
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.event.pull_request.head.ref }}
                  - name: Run Terrascan
                    id: terrascan
                    uses: tenable/terrascan-action@main
                    with:
                      iac_type: 'terraform'
                      iac_version: 'v14'
                      policy_type: 'aws,github'
                      only_warn: true
                      sarif_upload: true
                      non_recursive: true
                      #iac_dir:
                      #policy_path:
                      #skip_rules:
                      #config_path:
                  - name: Upload SARIF file
                    uses: github/codeql-action/upload-sarif@v2
                    with:
                      sarif_file: terrascan.sarif
        EOT
      + file                = ".github/workflows/terrascan.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/workflows/terratest.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: terratest
            on:
              - pull_request
              -
            env:
              OAUTH_TOKEN_ID: ${{ secrets.OAUTH_TOKEN_ID }}
              TFE_TOKEN: ${{ secrets.TFE_TOKEN_SANDBOX }}
            
            permissions:
              id-token: write
              contents: read
              pull-requests: write
            
            jobs:
              terratest:
                runs-on: ubuntu-latest
                steps:
                  - name: configure aws credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: ${{ secrets.OIDC_ROLE }}
                      aws-region: ${{ secrets.AWS_REGION }}
                  - name: checkout
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.event.pull_request.head.ref }}
                      path: main
            
                  - uses: actions/setup-go@v3
                    with:
                      go-version: '>=1.17.0'
                  - name: run terratest
                    working-directory: main/tests
                    env:
                      GITHUB_TOKEN: ${{ secrets.token }}
                    run: |
                      export GOOS=linux GOARCH=amd64 CGO_ENABLED=0
                      go mod init test
                      go mod tidy > /dev/null
                      go test -v -count=1 -timeout 120m ./...
        EOT
      + file                = ".github/workflows/terratest.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".github/workflows/tfsec.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: tfsec
            on:
              pull_request:
            jobs:
              tfsec:
                name: tfsec-pr-commenter
                runs-on: ubuntu-latest
                steps:
                  - name: clone repo
                    uses: actions/checkout@master
                  - name: tfsec
                    uses: aquasecurity/tfsec-pr-commenter-action@v1.2.0
                    with:
                      github_token: ${{ github.token }}
        EOT
      + file                = ".github/workflows/tfsec.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".gitignore"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            .idea
            .vscode
            **/*.tfstate*
            *.tfstate*
            **/.terraform
            .terraform
            **/.terraform.lock.hcl
            .terraform.lock.hcl
            !**/.terraform-docs.yml
            !.terraform-docs.yml
            **/go.*
            go.*
            secrets.json
            **/variables.yml
            variables.yml
            !examples/complete/variables.yml
            secrets.yml
            **/secrets.json
            **/secrets.yml
            workspaces/*.yml
            !workspaces/*.enc.yml
            .env
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files[".pre-commit-config.yaml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            repos:
              - repo: https://github.com/pre-commit/pre-commit-hooks
                rev: v3.2.0
                hooks:
                  - id: trailing-whitespace
                  - id: end-of-file-fixer
                  - id: check-yaml
                  - id: check-added-large-files
            
              - repo: https://github.com/antonbabenko/pre-commit-terraform
                rev: v1.71.0 # Get the latest from: https://github.com/antonbabenko/pre-commit-terraform/releases
                hooks:
                  - id: terraform_fmt
                    name: Terraform fmt
                    description: Rewrites all Terraform configuration files to a canonical format.
                    entry: hooks/terraform_fmt.sh
                    language: script
                    files: (\.tf|\.tfvars)$
                    exclude: \.terraform\/.*$
                    fail_fast: true
            
                  - id: terraform_docs
                    name: Terraform docs
                    description: Inserts input and output documentation into README.md (using terraform-docs).
                    require_serial: true
                    entry: hooks/terraform_docs.sh
                    language: script
                    files: (\.tf|\.terraform\.lock\.hcl)$
                    exclude: \.terraform\/.*$
                    fail_fast: true
            
                  - id: terraform_validate
                    name: Terraform validate
                    description: Validates all Terraform configuration files.
                    require_serial: true
                    entry: hooks/terraform_validate.sh
                    language: script
                    files: (\.tf|\.tfvars)$
                    exclude: \.terraform\/.*$
                    fail_fast: true
            
                  - id: terraform_providers_lock
                    name: Lock terraform provider versions
                    description: Updates provider signatures in dependency lock files.
                    require_serial: true
                    entry: hooks/terraform_providers_lock.sh
                    language: script
                    files: (\.terraform\.lock\.hcl)$
                    exclude: \.terraform\/.*$
                    fail_fast: true
            
                  - id: terraform_tflint
                    name: Terraform validate with tflint
                    description: Validates all Terraform configuration files with TFLint.
                    require_serial: true
                    entry: hooks/terraform_tflint.sh
                    language: script
                    files: (\.tf|\.tfvars)$
                    exclude: \.terraform\/.*$
                    fail_fast: true
            
                  - id: terraform_tfsec
                    name: Terraform validate with tfsec
                    description: Static analysis of Terraform templates to spot potential security issues.
                    require_serial: true
                    entry: hooks/terraform_tfsec.sh
                    language: script
                    fail_fast: true
            
                  - id: terraform_checkov
                    name: Checkov
                    description: Runs checkov on Terraform templates.
                    entry: hooks/terraform_checkov.sh
                    language: script
                    always_run: false
                    files: \.tf$
                    exclude: \.terraform\/.*$
                    require_serial: true
                    fail_fast: true
            
                  - id: tfupdate
                    name: tfupdate
                    description: Runs tfupdate on Terraform templates.
                    language: script
                    entry: hooks/tfupdate.sh
                    args:
                      - --args=terraform
                    files: \.tf$
                    require_serial: true
                    fail_fast: true
            
              - repo: local
                hooks:
                  - id: terratest
                    name: terratest
                    entry: tests/complete/precommit.sh
                    pass_filenames: false
                    types: [ go ]
                    language: system
                    fail_fast: true
        EOT
      + file                = ".pre-commit-config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["README.md"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # terraform-module-template
            
            <!-- BEGIN_TF_DOCS -->
            
            # Examples
            
            ```hcl
            module "random" {
              source = "../../"
              length = var.length
            }
            ```
            
            ## Providers
            
            | Name | Version |
            |------|---------|
            | <a name="provider_random"></a> [random](#provider\_random) | 3.2.0 |
            
            ## Inputs
            
            | Name | Description | Type | Default | Required |
            |------|-------------|------|---------|:--------:|
            | <a name="input_length"></a> [length](#input\_length) | Length of the password | `number` | `14` | no |
            
            ## Outputs
            
            | Name | Description |
            |------|-------------|
            | <a name="output_random_password"></a> [random\_password](#output\_random\_password) | this is a dummy password |
            
            ## Resources
            
            - resource.random_password.password (main.tf#1)
            
            <!-- END_TF_DOCS -->
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/README.md"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # terraform-module-template
        EOT
      + file                = "examples/complete/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/main.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #module "random" {
            #  source = "../../"
            #  length = var.length
            #}
        EOT
      + file                = "examples/complete/main.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/outputs.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #output "random_password" {
            #  value       = module.random.random_password
            #  description = "this is a dummy password"
            #}
        EOT
      + file                = "examples/complete/outputs.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/providers.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #provider "random" {}
        EOT
      + file                = "examples/complete/providers.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/variables.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #variable "length" {
            #  default     = 14
            #  description = "Length of the password"
            #  type        = number
            #}
        EOT
      + file                = "examples/complete/variables.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["examples/complete/versions.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #terraform {
            #  required_providers {
            #    random = {
            #      source  = "hashicorp/random"
            #      version = "3.2.0"
            #    }
            #  }
            #}
        EOT
      + file                = "examples/complete/versions.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["main.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #resource "random_password" "password" {
            #  length           = var.length
            #  special          = true
            #  override_special = "!#$%&*()-_=+[]{}<>:?"
            #}
        EOT
      + file                = "main.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["outputs.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #output "random_password" {
            #  value       = random_password.password.length
            #  description = "this is a dummy password"
            #}
        EOT
      + file                = "outputs.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["providers.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #provider "random" {}
        EOT
      + file                = "providers.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["tests/complete/complete_test.go"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            package test
            
            import (
            	"github.com/gruntwork-io/terratest/modules/terraform"
            	"github.com/joho/godotenv"
            	"log"
            	"os"
            	"strconv"
            	"testing"
            	"time"
            )
            
            func TestCompleteExample(t *testing.T) {
            	godotenv.Load("../../.env")
            
            	// DELAY is the time in seconds to run terraform destroy after terraform apply
            	DELAY, _ := strconv.Atoi(os.Getenv("DELAY"))
            	terraformOptions := terraform.WithDefaultRetryableErrors(t, &terraform.Options{
            		TerraformDir: "../../examples/complete",
            		Vars:         map[string]interface{}{},
            		Upgrade:      true,
            		Reconfigure:  true,
            	})
            
            	defer terraform.Destroy(t, terraformOptions)
            	// Delay the execution of the terraform destroy
            	defer func() {
            		delay(DELAY)
            	}()
            
            	terraform.InitAndApply(t, terraformOptions)
            
            }
            
            func delay(seconds int) {
            	for {
            		if seconds <= 0 {
            			break
            		} else {
            			log.Println(seconds)
            			time.Sleep(1 * time.Second)
            			seconds--
            		}
            	}
            }
        EOT
      + file                = "tests/complete/complete_test.go"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["tests/complete/precommit.sh"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/bash
            cd tests/complete
            rm -rf go.*
            export GOOS=linux GOARCH=amd64 CGO_ENABLED=0
            go mod init test
            go mod tidy >> /dev/null
            go test -count=1 -timeout 120m -v ./...
            exit $?
        EOT
      + file                = "tests/complete/precommit.sh"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["variables.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #variable "length" {
            #  default     = 14
            #  description = "Length of the password"
            #  type        = number
            #}
        EOT
      + file                = "variables.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_file.template_files["versions.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #terraform {
            #  required_providers {
            #    random = {
            #      source  = "hashicorp/random"
            #      version = "3.2.0"
            #    }
            #  }
            #}
        EOT
      + file                = "versions.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository_from_template["repo1"].github_repository_pull_request.template_files[0] will be created
  + resource "github_repository_pull_request" "template_files" {
      + base_ref              = "main"
      + base_repository       = "testing-template-repository-jkshdbjk"
      + base_sha              = (known after apply)
      + body                  = "Merge this PR"
      + draft                 = (known after apply)
      + head_ref              = "template_files"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "Added Template Files"
      + updated_at            = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pipo-flufi, Action: `pull_request`, Working Directory: ``, Workflow: `terraform validate`*